---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticConstructionGbxmlTypeid
source: html/fde8535e-501f-eee3-db5a-da383fa7067a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticConstructionGbxmlTypeid Property

"Construction Type Id"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticConstructionGbxmlTypeid { get; }
```